       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EX03.
       AUTHOR.        LEVI.
       DATE-WRITTEN.  23/03/2025.
       DATE-COMPILED. 23/03/2025.
      *REMARKS.       LE OS REGISTROS NO ARQUIVO
      *               CADALU(NUM,NOME,NOTA1,NOTA2,NOTA3)
      *               E GRAVA NO ARQUIVO CADATU(NUM, MEDIA)

       ENVIRONMENT DIVISION.
       SOURCE-COMPUTER. LEVI-PC.
       OBJECT-COMPUTER. LEVI-PC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.
       
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADALU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADATU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.     
       FD CADALU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADALU.DAT".

       01 REG-ENT.
           02 NUM-ENT  PIC 9(05).
           02 NOME-ENT PIC X(20).
           02 NOTA1    PIC 99V99.
           02 NOTA2    PIC 99V99.
           02 NOTA3    PIC 99V99.

       FD CADATU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADATU.DAT".

       01 REG-SAI.
           02 NUM-SAI PIC 9(05).
           02 MEDIA   PIC 99V99.

       WORKING-STORAGE SECTION.
       77 FIM-ARQ   PIC X(03) VALUE "NAO".
       77 SOMA-NOTA PIC 99V99 VALUE ZEROS.
       77 WMEDIA    PIC 99V99 VALUE ZEROS.

       PROCEDURE DIVISION.
       EXFIX.

       PERFORM INICIO.
       PERFORM PRINCIPAL
           UNTIL FIM-ARQ EQUAL "SIM".
       PERFORM TERMINO.
       STOP RUN.

       INICIO.
           OPEN INPUT CADALU
               OUTPUT CADATU.
           PERFORM LEITURA.
       
       LEITURA.
           READ CADALU
               AT END
               MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM GRAVACAO.
           PERFORM LEITURA.

       GRAVACAO.
           MOVE NUM-ENT TO NUM-SAI.
           MOVE ZEROS TO SOMA-NOTA.
           MOVE ZEROS TO WMEDIA.
           ADD NOTA1, NOTA2, NOTA3 TO SOMA-NOTA.
           DIVIDE SOMA-NOTA BY 3 GIVING WMEDIA.
           MOVE WMEDIA TO MEDIA.
           WRITE REG-SAI.

       TERMINO.
           CLOSE CADALU
                 CADATU.
